src/Tasks/ЗадачаПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Task>
		<Properties>
			<Name>ЗадачаПользователей</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Comment>Дата и время фактического выполнения задачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаТема</Name>
					<Comment>Содержание задачи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаПредмет</Name>
					<Comment>Предмет задачи</Comment>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаАвтор</Name>
					<Comment>Автор бизнес-процесса, который сформировал задачу</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаОписание</Name>
					<Comment>Подробное описание задачи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаНазначеннаяДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминаниеИспользовать</Name>
					<Comment>Напоминать о задаче</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминаниеРежим</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНапоминаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминаниеДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеЗадачи</Name>
					<Comment>Представление задачи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<AddressingAttribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Comment>Исполнитель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

src/Enums/ВариантыНапоминаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВариантыНапоминаний</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЧерезУказанноеВремя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСобытию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВУказанноеВремя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаВремяОтносительноСобытия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПосещению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВМоментСозданияЗадачи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Tasks/ЗадачаПользователей/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

// Обработчик заполнения объекта данными
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Дата                    = ТекущаяДата();
	СтруктурнаяЕдиница      = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	Исполнитель             = ПараметрыСеанса.ТекущийПользователь;
	ЗадачаАвтор             = ПараметрыСеанса.ТекущийПользователь;
	НапоминаниеИспользовать = Истина;
	НапоминаниеРежим        = Перечисления.ВариантыНапоминаний.ЧерезУказанноеВремя;
	НапоминаниеДатаНачала   = Дата + 3600;

	// На основании документа взаимодействия
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Взаимодействие") Тогда
		
		Дата                            = ДанныеЗаполнения.Дата;
		Наименование					= Строка(ДанныеЗаполнения.ВидОперации) + ": " + ДанныеЗаполнения.Тема;
		СтруктурнаяЕдиница              = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
		Исполнитель             		= ДанныеЗаполнения.АвторДокумента;
		ЗадачаТема                      = Строка(ДанныеЗаполнения.ВидОперации) + ": " + ДанныеЗаполнения.Тема;
		ЗадачаОписание                  = ДанныеЗаполнения.Содержание;
		ЗадачаПредмет                   = ДанныеЗаполнения;  
		ЗадачаАвтор                     = ДанныеЗаполнения.АвторДокумента;
		НапоминаниеИспользовать         = ДанныеЗаполнения.НапоминаниеИспользовать;
		НапоминаниеРежим        		= ДанныеЗаполнения.НапоминаниеРежим;
		НапоминаниеДатаНачала   		= ДанныеЗаполнения.НапоминаниеДатаНачала;		
		ЗадачаНазначеннаяДатаВыполнения = ДанныеЗаполнения.ДатаНапоминания;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда	
		Если ДанныеЗаполнения.Свойство("ЗадачаПредмет") И ЗначениеЗаполнено(ДанныеЗаполнения.ЗадачаПредмет) Тогда
			ЭтотОбъект.ЗадачаПредмет = ДанныеЗаполнения.ЗадачаПредмет;		
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

// Обработка проверки заполнения
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Наименование  = ЗадачаТема;
	  
КонецПроцедуры

// Обработка перед записью объекта
Процедура ПередЗаписью(Отказ)
	
	ПредставлениеЗадачи = ЗадачаТема+?(ЗадачаПредмет<>Неопределено,", "+Строка(ЗадачаПредмет),"");
	
	Если Выполнена Тогда
		ДатаИсполнения  = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

// Обработчик при записи объекта
Процедура ПриЗаписи(Отказ)
	
	Если Выполнена Тогда
				
		// Если предметом задачи я вляется взаимодействие, выполнить его.
		Если ТипЗнч(ЗадачаПредмет) = Тип("ДокументСсылка.Взаимодействие") Тогда // И НЕ ЗадачаПредмет.ЗадачаОтработана  Тогда 
			ОбъектДокумента = ЗадачаПредмет.ПолучитьОбъект();
			ОбъектДокумента.ЗадачаОтработана = Истина;
			ОбъектДокумента.Записать();
		КонецЕсли;	
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
